name: "fingerprinter"
platform: "tensorflow_savedmodel"
max_batch_size: 256

input [
  {
    name: "input_1"
    data_type: TYPE_FP32
    dims: [ 256, 34, 1 ]
  }
]

output [
  {
    name: "output_0"
    data_type: TYPE_FP32
    dims: [ 128 ]
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 50000
}
